In [1]:
import numpy as np
import pandas as pd

In [2]:
import numpy as np
a = [1, 2, 3, 4, 5, 5, 6, 7, 8, 9, 9, 9, 0]
print(np.mean(a))
print(np.median(a))
print(np.sum(a))

5.230769230769231
5.0
68

In [3]:
import numpy as np 
    
  
# 2D array  
arr = [[14, 17, 12, 33, 44],   
       [15, 6, 27, 8, 19],  
       [23, 2, 54, 1, 4, ]]  
    
# mean of the flattened array  
print("\nmean of arr, axis = None : ", np.mean(arr))  
    
# mean along the axis = 0  
print("\nmean of arr, axis = 0 : ", np.mean(arr, axis = 0))  
   
# mean along the axis = 1  
print("\nmean of arr, axis = 1 : ", np.mean(arr, axis = 1)) 
  
out_arr = np.arange(3) 
print("\nout_arr : ", out_arr)  
print("mean of arr, axis = 1 : ",   np.mean(arr, axis = 1, out = out_arr))

mean of arr, axis = None :  18.6

mean of arr, axis = 0 :  [17.33333333  8.33333333 31.         14.         22.33333333]

mean of arr, axis = 1 :  [24.  15.  16.8]

out_arr :  [0 1 2]
mean of arr, axis = 1 :  [24 15 16]

In [8]:
# Python Program illustrating  
# numpy.median() method   
import numpy as np 
    
# 2D array  
arr = [[14, 17, 12, 33, 44],   
       [15, 6, 27, 8, 19],  
       [23, 2, 54, 1, 4, ]]  
    
# median of the flattened array  
print("\nmedian of arr, axis = None : ", np.median(arr))  
    
# median along the axis = 0  
print("\nmedian of arr, axis = 0 : ", np.median(arr, axis = 0))  
   
# median along the axis = 1  
print("\nmedian of arr, axis = 1 : ", np.median(arr, axis = 1)) 
  
out_arr = np.arange(3) 
print("\nout_arr : ", out_arr)  
print("median of arr, axis = 1 : ", np.median(arr, axis = 1, out = out_arr))

median of arr, axis = None :  15.0

median of arr, axis = 0 :  [15.  6. 27.  8. 19.]

median of arr, axis = 1 :  [17. 15.  4.]

out_arr :  [0 1 2]
median of arr, axis = 1 :  [17 15  4]

In [4]:
a = np.array([[1,2],[3,4]]) 
b = np.array([[11,12],[13,14]]) 

np.dot(a,b)

array([[37, 40],
       [85, 92]])

# Importing Data

In [6]:
# Store the url string that hosts our .csv file
url = "a.csv"

# Read the .csv file and store it as a pandas Data Frame
df = pd.read_csv(url)

# Viewing Data

In [7]:
df

            Name  Age Gender  GenderGroup
0           Zain   21      M            2
1        Mustafa   24      M            2
2         Faryal   23      F            1
3          Faiza   21      F            1
4           Moiz   13      M            2
5         Fabiha   23      F            1
6           Mina   26      F            1
7           Sara   35      F            1
8          Maham   25      F            1
9           Asad   30      M            2
10  Rafay(Duddu)   20      M            2

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df.columns

Index(['Name', 'Age', 'Gender', 'GenderGroup'], dtype='object')

In [11]:
# We can view our Data Frame by calling the head() function
df.head()

      Name  Age Gender  GenderGroup
0     Zain   21      M            2
1  Mustafa   24      M            2
2   Faryal   23      F            1
3    Faiza   21      F            1
4     Moiz   13      M            2

# .loc()
loc() takes two single/list/range operator separated by ','. The first one indicates the row and the second one indicates columns.

In [19]:
# Return all observations of CWDistance
df.loc[:,"Name"]

0             Zain
1          Mustafa
2           Faryal
3            Faiza
4             Moiz
5           Fabiha
6             Mina
7             Sara
8            Maham
9             Asad
10    Rafay(Duddu)
Name: Name, dtype: object

In [20]:
# Select all rows for multiple columns, ["Name", "Gender", "GenderGroup"]
df.loc[:,["Name", "Gender", "GenderGroup"]]

            Name Gender  GenderGroup
0           Zain      M            2
1        Mustafa      M            2
2         Faryal      F            1
3          Faiza      F            1
4           Moiz      M            2
5         Fabiha      F            1
6           Mina      F            1
7           Sara      F            1
8          Maham      F            1
9           Asad      M            2
10  Rafay(Duddu)      M            2

In [21]:
# Select few rows for multiple columns, ["Name", "Gender", "GenderGroup"]
df.loc[:3, ["Name", "Gender", "GenderGroup"]]

      Name Gender  GenderGroup
0     Zain      M            2
1  Mustafa      M            2
2   Faryal      F            1
3    Faiza      F            1

In [22]:
# Select range of rows for all columns
df.loc[1:5]

      Name  Age Gender  GenderGroup
1  Mustafa   24      M            2
2   Faryal   23      F            1
3    Faiza   21      F            1
4     Moiz   13      M            2
5   Fabiha   23      F            1

In [23]:
df.loc[:7, "Name"]

0       Zain
1    Mustafa
2     Faryal
3      Faiza
4       Moiz
5     Fabiha
6       Mina
7       Sara
Name: Name, dtype: object

# .iloc()
.iloc() is integer based slicing, whereas .loc() used labels/column names. Here are some examples:

In [24]:
df.iloc[:4]

      Name  Age Gender  GenderGroup
0     Zain   21      M            2
1  Mustafa   24      M            2
2   Faryal   23      F            1
3    Faiza   21      F            1

In [25]:
df.iloc[1:5, 0:3]

      Name  Age Gender
1  Mustafa   24      M
2   Faryal   23      F
3    Faiza   21      F
4     Moiz   13      M

In [26]:
df.dtypes

Name           object
Age             int64
Gender         object
GenderGroup     int64
dtype: object

In [27]:
# List unique values in the df['Gender'] column
df.Gender.unique()

array(['M', 'F'], dtype=object)

In [28]:
# List unique values in the df['GenderGroup'] column
df.GenderGroup.unique()

array([2, 1], dtype=int64)

In [29]:
# List unique values in the df['Name'] column
df.Name.unique()

array(['Zain', 'Mustafa', 'Faryal', 'Faiza', 'Moiz', 'Fabiha', 'Mina',
       'Sara', 'Maham', 'Asad', 'Rafay(Duddu)'], dtype=object)

In [32]:
df.groupby(['Gender','GenderGroup']).size()

Gender  GenderGroup
F       1              6
M       2              5
dtype: int64